Tekla Open API Reference for Tekla Structures 2025
Analysis Class
 The Analysis class is a class from which the user can query analysis instances.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.Analysis
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class Analysis
<SerializableAttribute>
Public Class Analysis
The Analysis type exposes the following members.
Constructors
Name | Description
Analysis
 Initializes a new instance of the Analysis class.
Top
Methods
Name | Description
GetAnalysisObjectSelector
 Returns the analysis object selector.
GetConnectionStatus
 Checks the connection status of the Tekla Structures process.
Top
Examples
using Tekla.Structures.Analysis;
public class Class
{
    public void Example()
    {
        Analysis Analysis = new Analysis();
    }
}
See Also
Reference
Tekla.Structures.Analysis Namespace